## pandas

### 1] creating DataFrame

In [1]:
import pandas as pd

In [10]:
import pandas as pd

data = {
    'Department': ['HR', 'IT', 'HR', 'IT', 'Finance'],
    'Age': [25, 30, 45, 35, 40],
    'Salary': [50000, 60000, 52000, 58000, 70000]
}
df = pd.DataFrame(data)
print(df)

  Department  Age  Salary
0         HR   25   50000
1         IT   30   60000
2         HR   45   52000
3         IT   35   58000
4    Finance   40   70000

### 2] csv read and save

#### read syntax

In [ ]:
df = pd.read_csv('data.csv')

#### example

In [3]:
df = pd.read_csv('C:/Users/Hi/Downloads/titanic.csv')

### 3] Analyzing DataFrames

#### syntax

In [ ]:
df.head(indexno)

#### example

In [4]:
df.head(4)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False

In [7]:
df.tail(4)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

### 4] aggregate() functions

#### * sum()
#### * min()
#### * max()
#### * mean()
#### * describe()
#### * count()
#### * std()

####  * sum()

##### example

In [11]:
df['Age'].sum()

np.int64(175)

#### * min()

##### example

In [14]:
df['Age'].min()

np.int64(25)

#### * max

##### example

In [16]:
df['Age'].max()

np.int64(45)

#### * mean()

##### exaple

In [19]:
df['Age'].mean()

np.float64(35.0)

#### * standard diviation

##### example

In [21]:
df['Age'].std()

np.float64(7.905694150420948)

#### *  describe()

##### example

In [22]:
df['Age']. describe()

count     5.000000
mean     35.000000
std       7.905694
min      25.000000
25%      30.000000
50%      35.000000
75%      40.000000
max      45.000000
Name: Age, dtype: float64

#### *  count()

##### example

In [25]:
df['Age']. count()

np.int64(5)

### 5] DataFrame colomn add & dlt

In [ ]:
# syntax
df['newcolomn'] = df['colomname'] + 'values'

##### syntax & exapmle

In [32]:
# add colomn
df['increase salary'] = df['Salary'] + 1000
df

  Department  Age  Salary  increase salary
0         HR   25   50000            51000
1         IT   30   60000            61000
2         HR   45   52000            53000
3         IT   35   58000            59000
4    Finance   40   70000            71000

In [34]:
# dlt colomn

#syntax
df = df.drop('ColumnName', axis=1)
#example

df = df.drop('increase salary', axis=1)
df

  Department  Age  Salary
0         HR   25   50000
1         IT   30   60000
2         HR   45   52000
3         IT   35   58000
4    Finance   40   70000

In [35]:
# Dlt multiple columns
df = df.drop(['Salary', 'Age'], axis=1)
df

  Department
0         HR
1         IT
2         HR
3         IT
4    Finance